Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.DataProductMetadataDto
Represents the root of the index.json file.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.DataProductMetadataDto.ProductsByName
Mapping of product name to Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.Product metadata.
Represent the top-level "products" object in the data product metadata (`index.json`).
Key: product name
Value: metadata for each data product, including lifecycle information, an optional end-of-life date, and optional
metadata entries for each product, etc.